Библиотека_электронных_документов_демо/src/InformationRegisters/_ДемоДополнительныеСведения/_ДемоДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ДемоДополнительныеСведения</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic._ДемоДополнительныеРеквизитыИСведения</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef._ДемоДополнительныеРеквизитыИСведения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Библиотека_электронных_документов_демо/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

Библиотека_электронных_документов_демо/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
</mdclass:Enum>

Библиотека_электронных_документов_демо/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef._ДемоПартнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Библиотека_электронных_документов_демо/src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Библиотека_электронных_документов_демо/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Библиотека_электронных_документов_демо/src/CommonModules/_ДемоОбменССайтом/Module.bsl
#Область СлужебныеПрограммныйИнтерфейс

Процедура УстановитьПараметрКомпоновки(ПараметрыКомпоновки, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	ЭлементПараметра = ПараметрыКомпоновки.Добавить();
	ЭлементПараметра.Имя = ИмяПараметра;
	ЭлементПараметра.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	ЭлементПараметра.Значение = ЗначениеПараметра;
	
КонецПроцедуры

Функция ПроизвольныйКонтрагент() Экспорт
	
	Контрагент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Контрагент = Выборка.Контрагент;
	КонецЕсли;
	
	Возврат Контрагент;
	
КонецФункции

Функция РеквизитыОбменаТоварами() Экспорт
	
	МассивРеквизитов = Новый Массив;
	
	МассивРеквизитов.Добавить("СписокТочекСамовывоза");
	
	Возврат МассивРеквизитов;
	
КонецФункции

Функция РеквизитыОбменаЗаказами() Экспорт
	
	МассивРеквизитов = Новый Массив;
	
	МассивРеквизитов.Добавить("СпособИдентификацииКонтрагентов");
	МассивРеквизитов.Добавить("ЕдиницаИзмеренияНовойНоменклатуры");
	МассивРеквизитов.Добавить("ГруппаДляНовойНоменклатуры");
	МассивРеквизитов.Добавить("ГруппаДляНовыхКонтрагентов");
	МассивРеквизитов.Добавить("Организация");
	МассивРеквизитов.Добавить("НомерНаСайте");
	МассивРеквизитов.Добавить("ДатаНаСайте");
	МассивРеквизитов.Добавить("СоответствиеСтатусовЗаказов");
	
	Возврат МассивРеквизитов;
	
КонецФункции

Функция СоздатьКонтрагента( ДанныеКонтрагента, ПрикладныеПараметры, ОписаниеОшибки) Экспорт
	
	НовыйКонтрагент						= Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКонтрагент.КодПоОКПО			= ДанныеКонтрагента.ОКПО;
	НовыйКонтрагент.ИНН					= ДанныеКонтрагента.ИНН;
	НовыйКонтрагент.КПП					= ДанныеКонтрагента.КПП;
	НовыйКонтрагент.ЮрФизЛицо			= ?(ДанныеКонтрагента.ЮрЛицо, Перечисления.ЮрФизЛицо.ЮрЛицо,
											Перечисления.ЮрФизЛицо.ФизЛицо);
	НовыйКонтрагент.Наименование		= ДанныеКонтрагента.Наименование;
	НовыйКонтрагент.НаименованиеПолное	= ДанныеКонтрагента.ПолноеНаименование;
	НовыйКонтрагент.Родитель			= ПрикладныеПараметры.ГруппаДляНовыхКонтрагентов;
	НовыйКонтрагент.НаименованиеПолное	= ДанныеКонтрагента.ОфициальноеНаименование;	
	НовыйКонтрагент.Записать();
	
	Возврат НовыйКонтрагент.Ссылка;
	
КонецФункции

Процедура НайтиСоздатьЕдиницуИзмерения(ЕдиницаИзмерения,ДанныеЕдиницыИзмерения) Экспорт
	
	КодБазовойЕдиницы = ДанныеЕдиницыИзмерения.КодБазовойЕдиницы;
	Если ЗначениеЗаполнено(КодБазовойЕдиницы)Тогда
		ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоКоду(КодБазовойЕдиницы);
	КонецЕсли;
	
	НаименованиеБазовойЕдиницы = ДанныеЕдиницыИзмерения.НаименованиеБазовойЕдиницы;
	
	Если ЗначениеЗаполнено(НаименованиеБазовойЕдиницы) И Не ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(НаименованиеБазовойЕдиницы);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КодБазовойЕдиницы) И Не ЗначениеЗаполнено(НаименованиеБазовойЕдиницы) Тогда
		Возврат;
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ЕдиницаПоКлассификатору = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		ЕдиницаПоКлассификатору.Код = "796";
		ЕдиницаПоКлассификатору.Наименование = "Штука";
		ЕдиницаПоКлассификатору.МеждународноеСокращение = "PCE";
		ЕдиницаПоКлассификатору.Записать();
		ЕдиницаПоКлассификатору = ЕдиницаПоКлассификатору.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьДокумента(Документ, СтруктураРеквизитовТовары, Параметры) Экспорт
	
	Документ.Товары.Очистить();
	Для Каждого ТекСтрока Из СтруктураРеквизитовТовары Цикл
		
		НоваяСтрока = Документ.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Характеристика = ТекСтрока.Характеристика;
	КонецЦикла;
	
КонецПроцедуры

// Ищет валюту по коду
//
Процедура ОбработатьВалютуXML(Валюта,КодВалютыСтрока) Экспорт
		
	Валюта = Справочники.Валюты.НайтиПоНаименованию(КодВалютыСтрока);
	
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьЗначенияСвойств(ТаблицаСвойств, ЗаказПокупателя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений._ДемоДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство.ЭтоДополнительноеСведение = ИСТИНА
	|	И ДополнительныеСведения.Объект = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ЗаказПокупателя);
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Функция НайтиНоменклатуруПоАртикулуНаименованию(Артикул, Наименование) Экспорт
	
	Если ЗначениеЗаполнено(Артикул) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Артикул
		|	И НЕ Номенклатура.ЭтоГруппа");
		
		Запрос.УстановитьПараметр("Артикул", Артикул);
		
	ИначеЕсли ЗначениеЗаполнено(Наименование) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование = &Наименование
		|	И НЕ Номенклатура.ЭтоГруппа");
		
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат.Выгрузить()[0][0];
		
КонецФункции

// По значению процента налога определяет ставку НДС.
// Параметры:
// СтавкаНалогаСтавка. Тип - строка. Строковое представление значения ставки ,например, "18","10".
// ЗначениеСтавки. Тип - перечисление ссылка, Справочник Ссылка, значение ставки НДС, выраженное элементов метаданных прикладного решения.
//
Процедура ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(СтавкаНалогаСтавка, ЗначениеСтавки) Экспорт
	
	Если СтавкаНалогаСтавка = "18" Тогда
		ЗначениеСтавки = Перечисления.СтавкиНДС.НДС18;
	Иначе
		ЗначениеСтавки = Перечисления.СтавкиНДС.НДС10;
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗафиксироватьИзменениеТоваровПоСкладамПриПроведении(Источник, Отказ, РежимПроведения) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Источник.Движения._ДемоТоварыНаСкладах.Записывать = Истина;
		Для Каждого СтрокаТаблицы Из Источник.Товары Цикл
			Движение = Источник.Движения._ДемоТоварыНаСкладах.Добавить();
			Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
			Движение.Период         = Источник.Дата;
			Движение.Номенклатура   = СтрокаТаблицы.Номенклатура;
			Движение.Характеристика = СтрокаТаблицы.Характеристика;
			Движение.Количество     = СтрокаТаблицы.Количество;
		КонецЦикла;
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		
		Источник.Движения._ДемоТоварыНаСкладах.Записывать = Истина;
		Для Каждого СтрокаТаблицы Из Источник.Товары Цикл
			Движение = Источник.Движения._ДемоТоварыНаСкладах.Добавить();
			Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
			Движение.Период         = Источник.Дата;
			Движение.Номенклатура   = СтрокаТаблицы.Номенклатура;
			Движение.Характеристика = СтрокаТаблицы.Характеристика;
			Движение.Количество     = СтрокаТаблицы.Количество;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
